Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap
The Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap class provides a set of constants and extension methods
for mapping System.String values representing object type identifiers to and from actual object types.

Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap.DotNetPlugin
The identifier for .NET plug-ins.

Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap.DotNetJoint
The identifier for the system joint plugin type.

Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap.SystemComponent
The identifier for the system joint type.

Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap.SystemJointByOneSecondary
The identifier for the system joint type (for one secondary).

Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap.SystemMacro
The identifier for the system macro type.

Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap.UserComponent
The identifier for the user joint type.

Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap.Detail
The identifier for the detail type.

Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap.StringToTypeMap
A dictionary mapping string identifiers to their associated System.Type definitions.

Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap.#cctor
Initializes static members of the Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap class.

Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap.TryGetString(System.Type,System.String@)
Tries to get the System.String representation for a given System.Type.
type: The System.Type to get the matching System.String value for.
typeString: The System.String value matching the given System.Type.
Returns: True if a matching System.String is found; otherwise, false.

Tekla.Structures.DirectManipulation.Model.ModelObjectTypeStringMap.TryGetType(System.String,System.Type@)
Tries to get the System.Type representation for a given System.Type.
typeString: The System.String to get the matching System.Type value for.
type: The System.Type value matching the given System.String.
Returns: True if a matching System.Type is found; otherwise, false.